#! /bin/usr/perl

print "Введите день\n";	
$day= <STDIN>;
print "Введите месяц\n";
$month = <STDIN>;
print "Введите год\n";
$year = <STDIN>;


$maks = "Суворов Максим";
$khalim = "Хамзин Халим";
$ilyas = "Хусаинов Ильяс";
$^ = SALUT_FORMAT_TOP;
#Oтличие действия поледержателей состоит в том, что  "^" не отсекает
$~=SALUT_FORMAT; 
write;		

format SALUT_FORMAT=	
День:^## 
$day
Месяц:^## 
$month
Год:^####  
$year
.			
			
format SALUT_FORMAT_TOP=	
**************************Лабораторная работа №1*************************
*******Общая структура программы. Ввод и вывод информации. Форматы*******

1:^|||||||||||||||||||||||||||
$maks
2:^>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>	
$khalim
3:^|||||||||||||||||||||||||||
$ilyas
.


